app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def all
    @articles = Article.all