app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-08-11 15:52:39.087649"], ["email", "jschmid808@gmail.com"], ["password", "grimetime88"], ["updated_at", "2017-08-11 15:52:39.087649"], ["username", "idlePariah"]]
---
	def create
		@user = User.new(user_params)
		if @user.save